/**
  ************************************* Copyright ******************************   
  *                 (C) Copyright 2025,--,China, GCU.
  *                            All Rights Reserved    
  * FileName   : Servo.h   
  * Version    : v1.0		
  * Author     : --		
  * Date       : 2025-03-05         
  * Description:  
PWM 频率通常为 50Hz（周期 20ms），占空比范围决定旋转角度：

0° (最小角度) → 0.5ms 高电平 (占空比 ≈ 2.5%)
90° (中位角度) → 1.5ms 高电平 (占空比 ≈ 7.5%)
180° (最大角度) → 2.5ms 高电平 (占空比 ≈ 12.5%)  



psc =83  计数频率为1mhz 1us
arr = 计数频率/目标频率 -1
arr= 1mhz/50hz-1=20000 -1 =19999
  ******************************************************************************
 */
#ifndef __SERVO_H_
#define __SERVO_H_

/*include----------------------------------------------------------------------*/
#include "MyApplication.h"
/*define-----------------------------------------------------------------------*/


/*variate statement------------------------------------------------------------*/


/*function statement-----------------------------------------------------------*/
void Servo_Init(void);
void Servo_SetAngle(uint8_t angle);
void Servo_Test(void);

#endif


 

